/**
 * โจทย์ backend ข้อที่ 5
 * การหมุน (rotation) จะทำการย้ายสมาชิกตัวแรกของอาร์เรย์ไปที่ตำแหน่งสุดท้าย 
 * ในโจทย์นี้มีอาร์เรย์เริ่มต้นคือ [ 1, 2, 3, 4, 5 ] และมีการหมุนไปทั้งหมด n ครั้ง
 * 
 * ตัวอย่าง
 * หมุน 3 ครั้ง
 * 
 * ข้อมูลเริ่มต้น: [ 1, 2, 3, 4, 5 ]
 * หมุน 1 ครั้ง: [ 5, 1, 2, 3, 4 ] (สมาชิกตัวแรก 1 ถูกย้ายไปตำแหน่งสุดท้าย)
 * หมุน 2 ครั้ง: [ 4, 5, 1, 2, 3 ] (สมาชิกตัวแรก 5 ถูกย้ายไปตำแหน่งสุดท้าย)
 * หมุน 3 ครั้ง: [ 3, 4, 5, 1, 2 ] (สมาชิกตัวแรก 4 ถูกย้ายไปตำแหน่งสุดท้าย)
 * 
 * ผลลัพธ์: [ 3, 4, 5, 1, 2 ]
 */

process.stdin.on('data', (data) => {
    const input = JSON.parse(data.toString());

    function exam05(round) {
        let arr = [ 1, 2, 3, 4, 5 ]
        // //  แก้ไขโค้ดตรงนี้
        // for (let i = 0; i < round; i++) {
        //     arr.unshift(arr.pop())
        // }
        // return arr

        let n = round % arr.length;
        // นำส่วนท้ายของอาร์เรย์มาต่อกับส่วนหน้า
        // slice(-n) เช่น slice(-3) = [ 3, 4, 5 ] slice(0, -3) = [ 1, 2 ] ไม่เอา 3 ตัวสุดท้าย
        let rotatedArr = arr.slice(-n).concat(arr.slice(0, -n));
      
        return rotatedArr;
    }

    console.log(exam05(input.round));
});